'use strict';

/**
 * ПРОДВИНУТОЕ ЗАДАНИЕ К УРОКУ 2
 * 1) Создать переменную num со значением 266219 (тип данных число)
 * 2) Вывести в консоль произведение (умножение) цифр этого числа
 * Например: число 123, при помощи javaScript получить каждое цифру ( 1, 2, 3 ) и перемножить их.
 * Правильно использовать цикл или методы перебора.
 * 3) Полученный результат возвести в степень 3, используя только 1 оператор (Math.pow не подходит)
 * 4) Вывести на экран первые 2 цифры полученного числа
 * 5) В отдельном репозитории для усложненных уроков, добавить папку или ветку со вторым уроком в свой репозиторий на GitHub 
 */

//дано целое число
const num = 266219;
console.log('число ', num);

//формируем строку ответов
let answerStr = '\n' + num + ' -> ';

//преобразуем число в строку, строку в массив цифр
let arr = num.toString().split('');
answerStr += arr[0];

//находим произведение всех цифр
//перебираем все элементы массива
let result = 1;
arr.forEach((item, i) => {
    result *= item;
    answerStr += ' * ' + item;
});
answerStr += ' = ' + result + ' -> ' + result;


console.log('Результат умножения всех цифр числа', num, 'равен', result);
//возводим в 3 степень
result **= 3;
answerStr += '^3 = ' + result;

console.log('Результат в 3 степени:', result, answerStr);

//выводим первы 2 цифры строки
console.log('Первые 2 цифры результата:', result.toString().substring(0, 2));