

/*
 * 
1) Создать переменную num со значением 266219 (тип данных число)

2) Вывести в консоль произведение (умножение) цифр этого числа
Например: число 123, при помощи javaScript получить каждое цифру ( 1, 2, 3 ) и перемножить их.
Правильно использовать цикл или методы перебора.

3) Полученный результат возвести в степень 3, используя только 1 оператор (Math.pow не подходит)

4) Вывести на экран первые 2 цифры полученного числа

5) В отдельном репозитории для усложненных уроков, добавить папку или ветку со вторым уроком в свой репозиторий на GitHub 
 */


//1) Создать переменную num со значением 266219 (тип данных число)
let num = 266219;
console.log('num: ', num);


// 2) Вывести в консоль произведение (умножение) цифр этого числа
// Например: число 123, при помощи javaScript получить каждое цифру ( 1, 2, 3 ) и перемножить их.
// Правильно использовать цикл или методы перебора.
let str = num.toString();
let len = str.length;
console.log(len);
let result = 1;
for (let i = 0; i < len; i++) {

    result *= str[i];
    console.log('i: ', i, str[i], `result: ${result}`);
}


//3) Полученный результат возвести в степень 3, используя только 1 оператор (Math.pow не подходит)

result = result ** 3;
console.log('result: ', result);


//4) Вывести на экран первые 2 цифры полученного числа
console.log(result.toString().substring(0, 2));